---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyle.IsReadOnly
source: html/a1504fb9-59e2-be78-3c84-2e292642e906.htm
---
# Autodesk.Revit.DB.TableCellStyle.IsReadOnly Property

Gets or sets whether this cell is read only.

## Syntax (C#)
```csharp
public bool IsReadOnly { get; set; }
```